In [2]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aarvark', 'artichoke', np.nan, 'avocado'])
string_data

0      aarvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [8]:
string_data[string_data.notnull()]

1    artichoke
3      avocado
dtype: object

In [9]:
from numpy import nan as NA

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA

In [14]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.980333       NaN       NaN
1 -0.888439       NaN       NaN
2 -0.609443       NaN -0.666198
3  2.448066       NaN -0.908348
4  0.613891  1.490243 -0.658944
5  0.912726  0.472957 -1.338252
6 -1.398851 -0.242591  0.442767

In [19]:
df.dropna(thresh=2)

          0         1         2
2 -0.609443       NaN -0.666198
3  2.448066       NaN -0.908348
4  0.613891  1.490243 -0.658944
5  0.912726  0.472957 -1.338252
6 -1.398851 -0.242591  0.442767

In [21]:
df.fillna(0)

          0         1         2
0 -0.980333  0.000000  0.000000
1 -0.888439  0.000000  0.000000
2 -0.609443  0.000000 -0.666198
3  2.448066  0.000000 -0.908348
4  0.613891  1.490243 -0.658944
5  0.912726  0.472957 -1.338252
6 -1.398851 -0.242591  0.442767

In [22]:
df.fillna({1: 0.5, 2:0})

          0         1         2
0 -0.980333  0.500000  0.000000
1 -0.888439  0.500000  0.000000
2 -0.609443  0.500000 -0.666198
3  2.448066  0.500000 -0.908348
4  0.613891  1.490243 -0.658944
5  0.912726  0.472957 -1.338252
6 -1.398851 -0.242591  0.442767

In [23]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -0.980333  0.000000  0.000000
1 -0.888439  0.000000  0.000000
2 -0.609443  0.000000 -0.666198
3  2.448066  0.000000 -0.908348
4  0.613891  1.490243 -0.658944
5  0.912726  0.472957 -1.338252
6 -1.398851 -0.242591  0.442767

In [25]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[1:4, 1] = NA
df.iloc[1, 2] = NA
df

          0         1         2
0 -0.953231 -0.817324 -0.059950
1  0.644431       NaN       NaN
2 -0.752945       NaN  0.432909
3  0.557398       NaN  0.091543
4 -1.287404  0.102449 -0.837650
5  0.205672  0.903168 -0.106860
6 -0.278004 -0.114423  0.156480

In [26]:
df.fillna(method='ffill')

          0         1         2
0 -0.953231 -0.817324 -0.059950
1  0.644431 -0.817324 -0.059950
2 -0.752945 -0.817324  0.432909
3  0.557398 -0.817324  0.091543
4 -1.287404  0.102449 -0.837650
5  0.205672  0.903168 -0.106860
6 -0.278004 -0.114423  0.156480

In [27]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.953231 -0.817324 -0.059950
1  0.644431 -0.817324 -0.059950
2 -0.752945 -0.817324  0.432909
3  0.557398       NaN  0.091543
4 -1.287404  0.102449 -0.837650
5  0.205672  0.903168 -0.106860
6 -0.278004 -0.114423  0.156480

In [29]:
df.fillna(df.mean())

          0         1         2
0 -0.953231 -0.817324 -0.059950
1  0.644431  0.018467 -0.053921
2 -0.752945  0.018467  0.432909
3  0.557398  0.018467  0.091543
4 -1.287404  0.102449 -0.837650
5  0.205672  0.903168 -0.106860
6 -0.278004 -0.114423  0.156480

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [33]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [34]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [35]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [44]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned bead', 'Bacon',
                               'pastrami', 'hpney ham', 'nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned bead     7.5
5        Bacon     8.0
6     pastrami     3.0
7    hpney ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork' : 'cow',
    'pastrami' : 'cow',
    'corned beef': 'cow',
    'honey ham' : 'pig',
    'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned bead
5          bacon
6       pastrami
7      hpney ham
8       nova lox
Name: food, dtype: object

In [47]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned bead     7.5     NaN
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    hpney ham     5.0     NaN
8     nova lox     6.0  salmon

In [48]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [53]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [56]:
transform = lambda x : x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [55]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
data.rename(index={'Ohio':'INDIANA'},
           columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [61]:
data.rename(index={'INDIADA':'Ohio'}, inplace=True)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [62]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [63]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [64]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [66]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [67]:
pd.cut(ages, [18,26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [68]:
groups_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=groups_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [70]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-3.163, -0.657], (0.689, 3.114], (-3.163, -0.657], (0.689, 3.114], (0.689, 3.114], ..., (-0.657, 0.00644], (-3.163, -0.657], (0.00644, 0.689], (-3.163, -0.657], (0.00644, 0.689]]
Length: 1000
Categories (4, interval[float64]): [(-3.163, -0.657] < (-0.657, 0.00644] < (0.00644, 0.689] < (0.689, 3.114]]

In [71]:
pd.cut(data, 4, precision=2)

[(-1.59, -0.024], (-0.024, 1.55], (-1.59, -0.024], (-0.024, 1.55], (1.55, 3.11], ..., (-1.59, -0.024], (-1.59, -0.024], (-0.024, 1.55], (-1.59, -0.024], (-0.024, 1.55]]
Length: 1000
Categories (4, interval[float64]): [(-3.17, -1.59] < (-1.59, -0.024] < (-0.024, 1.55] < (1.55, 3.11]]

In [72]:
pd.value_counts(cats)

(0.689, 3.114]       250
(0.00644, 0.689]     250
(-0.657, 0.00644]    250
(-3.163, -0.657]     250
dtype: int64

In [73]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000320     0.051710     0.004014    -0.006139
std       0.974336     1.035445     1.050544     0.978114
min      -3.542501    -3.103687    -3.541085    -2.908650
25%      -0.664038    -0.678797    -0.681839    -0.672171
50%       0.017799     0.081668     0.004337     0.018435
75%       0.649035     0.720045     0.671038     0.698973
max       3.032429     3.049877     3.414586     3.027741

In [74]:
col = data[2]
col[np.abs(col) > 3]

120   -3.041277
305   -3.541085
378    3.187173
616   -3.046038
632    3.414586
Name: 2, dtype: float64

In [76]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
120  1.191060 -0.354962 -3.041277  0.013152
123  3.032429  0.993778  0.168446 -0.165607
281 -0.208461 -0.363522  0.866946  3.027741
305  0.054089 -1.131942 -3.541085 -0.087503
378  0.463807 -1.336733  3.187173  0.873920
411  0.680890 -3.023906 -1.063425 -0.881560
582  0.455677  3.049877 -1.189530  1.622991
616  0.669087 -0.107868 -3.046038  1.075645
632  0.060685  0.509013  3.414586 -0.151287
800 -3.542501  0.987712  1.017874 -2.013296
915  0.672919 -3.103687 -0.598324  0.812751

In [77]:
data[np.abs(data) > 2] = 2

In [78]:
data[0:20]

           0         1         2         3
0   1.301582  0.787475 -1.900957 -1.083991
1  -1.475361  0.572109  0.258181  0.242411
2  -0.210368  0.593951  0.563541  0.526733
3  -0.893683 -0.326180  0.465058 -0.406069
4  -1.487063 -0.248127 -0.155430 -0.861319
5  -0.589591  2.000000 -0.292393  0.550528
6   2.000000  1.596933  0.240733  0.545374
7  -0.916866 -1.128225  1.161946  1.468421
8  -0.099307  1.349118  0.269777  0.556912
9  -0.847844 -0.718041 -1.621261 -0.180598
10 -1.061311 -1.045104 -0.189441 -0.082910
11 -0.924608 -1.195320  1.642116 -0.853794
12 -0.086478 -0.257764  0.577914  0.038082
13 -0.169980 -0.911796  0.240014 -1.390551
14 -1.295510  0.814703  0.594985 -0.156056
15 -1.801959 -0.860315  1.440762 -0.728279
16  0.044669 -0.270243  0.018542 -0.505377
17  0.665626 -1.218472 -1.377707  0.714021
18  0.143159  0.448366  2.000000 -0.306232
19 -0.590995  0.215968  1.700270 -0.230340

In [84]:
sampler = np.random.permutation(5)
sampler

array([4, 2, 1, 0, 3])

In [85]:
df = pd.DataFrame(np.arange(20).reshape(5,4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [86]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [89]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [90]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10, replace=True)
draws

2   -1
4    4
3    6
0    5
1    7
0    5
2   -1
1    7
4    4
1    7
dtype: int64

In [91]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [92]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [94]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [95]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [96]:
pices = [x.strip() for x in val.split(',')]
pices

['a', 'b', 'guido']

In [97]:
first, secone, third = pices
first + '::' + secone + '::' + third

'a::b::guido'

In [98]:
'::'.join(pices)

'a::b::guido'

In [99]:
'guido' in val

True

In [100]:
val.index('a')

0

In [101]:
val.find(':')

-1

In [102]:
val

'a,b, guido'

In [103]:
val.count(',')

2

In [104]:
val.replace(',', '::')

'a::b:: guido'

In [108]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gamil.com',
        'Rob': 'rob@gamil.com', 'Wes':np.nan
       }
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gamil.com
Rob        rob@gamil.com
Wes                  NaN
dtype: object

In [109]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [110]:
data.str.contains('gmail')

Dave     False
Steve    False
Rob      False
Wes        NaN
dtype: object

NameError: name 'pattern' is not defined